{
    "Grafica": "As operações disponíveis incluem:\n\n- **Ampliação:** Altera o tamanho da matriz.\n    - Primeiro, toma-se em uma Matriz Pontos Iniciais (MPI) de dimensão 3 x N, com todos os pontos da figura;\n    - Segundo, recebe-se o valor do Coeficiente de Ampliação (CA);\n    - Terceiro, cria-se uma Matriz Transformação Linear (MTL), sendo uma matriz diagonal que neste caso será preenchida com CA;\n    - Quarto, cria-se uma Matriz Pontos Finais (MPF) de dimensão 3 x N, inicialmente zerada;\n    - Quinto, Realiza a operação MPF = MTL + MPI;\n    - Sexto, MPF é uma matriz de dimensão 3 x N, então para cada coluna, plota um vértice;\n    - **OBS:** 3 x N pois deverá haver 3 linhas (x, y, z), e N pois podem haver diversos pontos. Além disso, deve-se ter como referência quais são os pontos ligantes.\n\n- **Translação:** Move a matriz em uma direção especificada.\n    - Primeiro, toma-se em uma Matriz Pontos Iniciais (MPI) de dimensão 3 x N, com todos os pontos da figura;\n    - Segundo, recebe-se uma Matriz Translação (MT), de dimensões 3 x N;\n    - Terceiro, cria-se uma Matriz Pontos Finais (MPF) de dimensão 3 x N, inicialmente zerada;\n    - Quarto, realiza-se a operação MPF = MPI + MT;\n    - Quinto, MPF é uma matriz de dimensão 3 x N, então para cada coluna, plota um vértice;\n    - **OBS:** MT pode ser um vetor (x, y, z), então prolongamos para uma matriz 3 x N com todas as colunas sendo (x, y, z).\n\n- **Rotação:** Rotaciona a matriz em torno dos eixos X, Y ou Z.\n    - Primeiro, toma-se em uma Matriz Pontos Iniciais (MPI) de dimensão 3 x N, com todos os pontos da figura;\n    - Segundo, recebe-se os ângulos de rotações (a, b, c) em função dos eixos X, Y e Z;\n    - Terceiro, cria-se uma Matriz Pontos Finais (MPF) de dimensão 3 x N, inicialmente zerada;\n    - Quarto, cria-se uma Matriz Rotação (MR) para cada rotação (MRx, MRy ou MRz);\n    - Quinto, é feito a conversão de x, y e z da seguinte forma:",
    "Grafica2": "- **Sexto:** para uma rotação em Z ficaria [[cos(a), -sen(a), 0], [sen(a), cos(a), 0], [0, 0, 1]];\n - **Sétimo:** opera-se MR = MRx * MRy * MRz; \n- **Oitavo:** MR é uma matriz de dimensão 3 x N, então para cada coluna, plota um vértice."
}